# Last Updated 04/22/2024

In [2]:
# import packages

import pandas as pd

pd.set_option('display.max_colwidth', None)

## Reading data with thousands = ','

# when a column contains comma in numbers (e.g., 150,000)

df = pd.read_csv("myfilename.csv", thousands=',')
df.head(1)

## Handling inconsistent values

In [5]:
# a list of Championship teams
d = {'state': ['Kansas', 'KS', 'New Jersey', 'NJ', 
                'New Jersey', 'District Of Columbia', 
                'California', 'CA', 'DC']}
df = pd.DataFrame(data=d)
df

                  state
0                Kansas
1                    KS
2            New Jersey
3                    NJ
4            New Jersey
5  District Of Columbia
6            California
7                    CA
8                    DC

In [6]:
df['state'].unique()

array(['Kansas', 'KS', 'New Jersey', 'NJ', 'District Of Columbia',
       'California', 'CA', 'DC'], dtype=object)

The above shows some data quality issue (e.g., Kansas, KS)

In [8]:
replace_values = {
    "Alabama": "AL",
    "Alaska": "AK",
    "Arizona": "AZ",
    "Arkansas": "AR",
    "California": "CA",
    "Colorado": "CO",
    "Connecticut": "CT",
    "Delaware": "DE",
    "Florida": "FL",
    "Georgia": "GA",
    "Hawaii": "HI",
    "Idaho": "ID",
    "Illinois": "IL",
    "Indiana": "IN",
    "Iowa": "IA",
    "Kansas": "KS",
    "Kentucky": "KY",
    "Louisiana": "LA",
    "Maine": "ME",
    "Maryland": "MD",
    "Massachusetts": "MA",
    "Michigan": "MI",
    "Minnesota": "MN",
    "Mississippi": "MS",
    "Missouri": "MO",
    "Montana": "MT",
    "Nebraska": "NE",
    "Nevada": "NV",
    "New Hampshire": "NH",
    "New Jersey": "NJ",
    "New Mexico": "NM",
    "New York": "NY",
    "North Carolina": "NC",
    "North Dakota": "ND",
    "Ohio": "OH",
    "Oklahoma": "OK",
    "Oregon": "OR",
    "Pennsylvania": "PA",
    "Rhode Island": "RI",
    "South Carolina": "SC",
    "South Dakota": "SD",
    "Tennessee": "TN",
    "Texas": "TX",
    "Utah": "UT",
    "Vermont": "VT",
    "Virginia": "VA",
    "Washington": "WA",
    "West Virginia": "WV",
    "Wisconsin": "WI",
    "Wyoming": "WY",
    "District Of Columbia": "DC",
    "American Samoa": "AS",
    "Guam": "GU",
    "Northern Mariana Islands": "MP",
    "Puerto Rico": "PR",
    "United States Minor Outlying Islands": "UM",
    "U.S. Virgin Islands": "VI",
}
    
df['state'] = df['state'].replace(replace_values)

df

  state
0    KS
1    KS
2    NJ
3    NJ
4    NJ
5    DC
6    CA
7    CA
8    DC

Great!!!

## Data qualit issues (e.g., inconsistent data)

For handling data quality issues, we often need to work with domain experts who know the data and this process can be very time consuming, accounting for 80% to 90% of our time. Sometimes, we may not be able to clean all inconsistent data.

Below is a simple demo.

In [11]:
# a list of Championship teams
d = {'company': ['ABB Inc.', 'ABB, Inc.', 'ABB Inc. Active Employee Group Benefit Plan', 
                 '7-Eleven', '7-Eleven', 
                 '7-Eleven, Inc. Comprehensive Welfare Benefits Plan No. 525', 
                '7-Eleven, Inc.']}
df = pd.DataFrame(data=d)
df

                                                      company
0                                                    ABB Inc.
1                                                   ABB, Inc.
2                 ABB Inc. Active Employee Group Benefit Plan
3                                                    7-Eleven
4                                                    7-Eleven
5  7-Eleven, Inc. Comprehensive Welfare Benefits Plan No. 525
6                                              7-Eleven, Inc.

In the above situation, we (business/data/systems/market/operations analysts) may not fully know: 

- whether ABB Inc. is the same as ABB Inc. Active Employee Group Benefit Plan.
- whether 7-Eleven is the same as 7-Eleven, Inc. Comprehensive Welfare Benefits Plan No. 525.
- possibly others ... 

Handling data inconsistency can be very challenging (and time consuming), especially in the case of **text** data. We typically cover different text cleaning techniques in **MIS 670**. 

For the final project (MIS 665), you can **ignore** this data inconsistency issue, which is beyond the scope of our class.

Below is a simple text cleaning approach for demonstration purposes only.

In [13]:
df['company'].str.split('Inc')

0                                                      [ABB , .]
1                                                     [ABB, , .]
2                   [ABB , . Active Employee Group Benefit Plan]
3                                                     [7-Eleven]
4                                                     [7-Eleven]
5    [7-Eleven, , . Comprehensive Welfare Benefits Plan No. 525]
6                                                [7-Eleven, , .]
Name: company, dtype: object

In [14]:
df['company'].str.split('Inc').str[0]

0          ABB
1         ABB,
2          ABB
3      7-Eleven
4      7-Eleven
5    7-Eleven,
6    7-Eleven,
Name: company, dtype: object

In [15]:
df['company'].str.split('Inc').str[0].str.replace(',','')

0         ABB
1         ABB
2         ABB
3     7-Eleven
4     7-Eleven
5    7-Eleven
6    7-Eleven
Name: company, dtype: object

In [16]:
df['company'].str.split('Inc').str[0].str.replace(',','').str.replace(' ','')

0         ABB
1         ABB
2         ABB
3    7-Eleven
4    7-Eleven
5    7-Eleven
6    7-Eleven
Name: company, dtype: object

Are you happy with the above result?

Then, do this!

In [18]:
df['company'] = df['company'].str.split('Inc').str[0].str.replace(',','').str.replace(' ','')
df

    company
0       ABB
1       ABB
2       ABB
3  7-Eleven
4  7-Eleven
5  7-Eleven
6  7-Eleven

## Complex queries

In [20]:
# a list of Championship teams
d = {'year': [2011, 2012, 2013, 2014, 2015, 2016, 2017, 2019, 2020, 2021], 
     'school': ['KSU', 'OSU', 'A&M', 'OU', 'Auburn', 'KSU', 'ISU', 'TCU', 'OU', 'Alabama'],
     'conference': ['BIG12', 'BIG10', 'SEC', 'BIG12', 'SEC', 'BIG12', 'BIG12', 'BIG12', 'BIG12', 'SEC']}
df = pd.DataFrame(data=d)
df

   year   school conference
0  2011      KSU      BIG12
1  2012      OSU      BIG10
2  2013      A&M        SEC
3  2014       OU      BIG12
4  2015   Auburn        SEC
5  2016      KSU      BIG12
6  2017      ISU      BIG12
7  2019      TCU      BIG12
8  2020       OU      BIG12
9  2021  Alabama        SEC

In [21]:
# What schools have won the Championship title more than once?

df.groupby('school').size()

school
A&M        1
Alabama    1
Auburn     1
ISU        1
KSU        2
OSU        1
OU         2
TCU        1
dtype: int64

In [22]:
schoolfre = df.groupby('school').size().reset_index()
schoolfre

    school  0
0      A&M  1
1  Alabama  1
2   Auburn  1
3      ISU  1
4      KSU  2
5      OSU  1
6       OU  2
7      TCU  1

In [23]:
topschools = schoolfre[schoolfre[0] > 1]
topschools

  school  0
4    KSU  2
6     OU  2

In [24]:
# how many schools won more than once in the dataset?
len(topschools)

2

In [25]:
# what conferences have schools having won more than once?
df.groupby('conference').size()   # this does not answer the question

conference
BIG10    1
BIG12    6
SEC      3
dtype: int64

In [26]:
# what conferences have schools having won more than once?
df.groupby(['conference', 'school']).size().reset_index()

  conference   school  0
0      BIG10      OSU  1
1      BIG12      ISU  1
2      BIG12      KSU  2
3      BIG12       OU  2
4      BIG12      TCU  1
5        SEC      A&M  1
6        SEC  Alabama  1
7        SEC   Auburn  1

In [27]:
conf = df.groupby(['conference', 'school']).size().reset_index()
conf.columns = ['conference', 'school', 'counts']
popconf = conf[conf['counts'] >= 2]
popconf['conference'].value_counts() # this is the right answer ("BIG12")

conference
BIG12    2
Name: count, dtype: int64

## Create a categorical column from a continuous column

In [ ]:
d = {'score': [95, 75, 92, 89, 70, 100, 100], 
     'subject': ['Eng', 'Math', 'Soc', 'Eng', 'Math', 'DA', 'DA']}
df = pd.DataFrame(data=d)
df

In [ ]:
# convert score to letter grade (above 80 pass, below 80 fail)
# https://stackoverflow.com/questions/43232753/how-to-change-the-values-of-a-column-based-on-two-conditions-in-python

df['letter_grade'] = 'Fail'
df.loc[df['score'] > 80,'letter_grade'] = 'Pass'
df

## Convert non-Eng & non-Math to "others"

In [ ]:
# convert non-Eng & non-Math to "others"
# https://stackoverflow.com/questions/43232753/how-to-change-the-values-of-a-column-based-on-two-conditions-in-python

df.loc[(df['subject'] != 'Eng') & (df['subject'] != 'Math'), 'subject'] = "others"
df

## Handling duplicates

In [ ]:
d = {'score': [95, 75, 92, 89, 70, 100, 100], 
     'subject': ['Eng', 'Math', 'Soc', 'Eng', 'Math', 'DA', 'DA']}
df = pd.DataFrame(data=d)
df

In [ ]:
# remove duplicates
mask = df.duplicated(keep=False)
print(mask)

In [ ]:
# display those duplicate rows for review
df[mask]

In [ ]:
# find out how many 
len(df[mask])

In [ ]:
# now drop those duplicated
dfnoduplicates = df.drop_duplicates(keep="first")
dfnoduplicates